Repository: FouadCoder/Book-Doctor
Catalog: book_doctor/lib/l10n/intl_*.arb
Languages: ar, es, ja

# LanguageArabic
source: Arabic
ar: العربية
es: Árabe
ja: アラビア語

# LanguageEnglish
source: English
ar: الإنجليزية
es: Inglés
ja: 英語

# LanguageSpanish
source: Spanish
ar: الإسبانية
es: Español
ja: スペイン語

# LanguageJapanese
source: Japanese
ar: اليابانية
es: Japonés
ja: 日本語

source: Payment
ar: الدفع
es: Pago
ja: 支払い

source: Language
ar: اللغة
es: Idioma
ja: 言語

# favourite
source: Favorite
ar: المفضلة
es: Favorito
ja: お気に入り

source: Dark Mode
ar: الوضع المظلم
es: Modo oscuro
ja: ダークモード

source: Log out
ar: تسجيل الخروج
es: Cerrar sesión
ja: ログアウト

# CreateAccount
source: Create your account
ar: أنشئ حسابك
es: Crea tu cuenta
ja: アカウントを作成する

source: Profile
ar: الملف الشخصي
es: Perfil
ja: プロフィール

source: Gender
ar: الجنس
es: Género
ja: 性別

source: Female
ar: أنثى
es: Femenino
ja: 女性

source: Male
ar: ذكر
es: Masculino
ja: 男性

source: Email
ar: البريد الإلكتروني
es: Correo electrónico
ja: メール

source: Name
ar: الاسم
es: Nombre
ja: 名前

source: Phone Number
ar: رقم الهاتف
es: Número de teléfono
ja: 電話番号

source: Address
ar: العنوان
es: Dirección
ja: 住所

source: Medical history
ar: التاريخ الطبي
es: Historial médico
ja: 病歴

source: Current medical
ar: الحالة الطبية الحالية
es: Médico actual
ja: 現在の医療情報

# NewPorfilePicture
source: New Profile Picture
ar: صورة الملف الشخصي الجديدة
es: Nueva foto de perfil
ja: 新しいプロフィール写真

# Gallrey
source: Choose from Gallery
ar: اختيار من المعرض
es: Elegir de la galería
ja: ギャラリーから選ぶ

# Camara
source: Capture with Camera
ar: التقاط باستخدام الكاميرا
es: Capturar con cámara
ja: カメラで撮影

source: Login
ar: تسجيل الدخول
es: Iniciar sesión
ja: ログイン

source: Login in your Account
ar: تسجيل الدخول إلى حسابك
es: Inicia sesión en tu cuenta
ja: アカウントにログイン

# SignCreateYouraccunt
source: Create your Account
ar: إنشاء حسابك
es: Crea tu cuenta
ja: アカウントを作成

source: Password
ar: كلمة المرور
es: Contraseña
ja: パスワード

# LoginGoogle
source: Login with Google
ar: تسجيل الدخول باستخدام جوجل
es: Iniciar sesión con Google
ja: Googleでログイン

# DontHvaeAccount
source: Don't have an account?
ar: لا تملك حسابًا؟
es: ¿No tienes una cuenta?
ja: アカウントがありませんか？

# HaveAccount
source: Have an account?
ar: هل لديك حساب؟
es: ¿Tienes una cuenta?
ja: アカウントを持っていますか？

source: Sign up
ar: التسجيل
es: Registrarse
ja: サインアップ

# SignGoogle
source: Sign up with Google
ar: التسجيل باستخدام جوجل
es: Regístrate con Google
ja: Googleでサインアップ

# ConfirmPassword
source: Confirm Passwork
ar: تأكيد كلمة المرور
es: Confirmar contraseña
ja: パスワードを確認

source: Success !
ar: نجاح!
es: ¡Éxito!
ja: 成功！

# MessageSuccess
source: Profile update successful! Thank you for keeping your information current
ar: تم تحديث الملف الشخصي بنجاح! شكرًا لك على تحديث معلوماتك
es: ¡Perfil actualizado con éxito! Gracias por mantener tu información actualizada.
ja: プロフィールの更新に成功しました！情報を最新に保っていただきありがとうございます。

source: Failed !
ar: فشل!
es: ¡Fallido!
ja: 失敗！

# MessageWrong
source: We encountered an error while updating your profile. Please try again or contact support if the issue persists.
ar: واجهنا خطأ أثناء تحديث ملفك الشخصي. يرجى المحاولة مرة أخرى أو الاتصال بالدعم إذا استمرت المشكلة.
es: Encontramos un error al actualizar tu perfil. Por favor, inténtalo de nuevo o contacta con soporte si el problema persiste.
ja: プロフィールの更新中にエラーが発生しました。もう一度お試しください。問題が解決しない場合はサポートに連絡してください。

source: Save
ar: حفظ
es: Guardar
ja: 保存

source: Go back
ar: العودة
es: Regresar
ja: 戻る

# AddName
source: Please add your name.
ar: يرجى إضافة اسمك.
es: Por favor, añade tu nombre.
ja: 名前を追加してください。

# AddAddress
source: Please provide your address.
ar: يرجى تقديم عنوانك.
es: Por favor, proporciona tu dirección.
ja: 住所を提供してください。

# SelecGender
source: Please select gender.
ar: يرجى اختيار الجنس.
es: Por favor, selecciona el género.
ja: 性別を選択してください。

source: Welcome!
ar: مرحبا!
es: ¡Bienvenido!
ja: ようこそ！

# MakeAcounnt
source: Let's get started by creating your account.
ar: لنبدأ بإنشاء حسابك.
es: Comencemos creando tu cuenta.
ja: アカウントを作成して始めましょう。

# ErrorMessage
source: Uh-oh! Looks like our doctors are taking a little nap. Try again soon!
ar: آه! يبدو أن أطبائنا يأخذون قسطًا من الراحة. حاول مرة أخرى قريبًا!
es: ¡Vaya! Parece que nuestros médicos están tomando una pequeña siesta. ¡Inténtalo de nuevo pronto!
ja: おっと！私たちの医師たちは少し休憩を取っているようです。すぐにもう一度試してください！

# OurDoctors
source: Healthcare Team
ar: فريق الرعاية الصحية
es: Equipo médico
ja: ヘルスケアチーム

source: Category
ar: الفئة
es: Categoría
ja: カテゴリー

source: Doctor Details
ar: تفاصيل الطبيب
es: Detalles del doctor
ja: 医師の詳細

# AboutDoctor
source: Biography
ar: السيرة الذاتية
es: Biografía
ja: バイオグラフィー

# Suchedules
source: Schedules
ar: الجداول
es: Horarios
ja: スケジュール

source: Schedule
ar: الجدول
es: Horario
ja: スケジュール

source: Available time
ar: الوقت المتاح
es: Hora disponible
ja: 利用可能時間

source: Available
ar: متاح
es: Disponible
ja: 利用可能

source: Not available
ar: غير متاح
es: No disponible
ja: 利用不可

source: Read more
ar: اقرأ المزيد
es: Leer más
ja: もっと読む

source: Read less
ar: اقرأ أقل
es: Leer menos
ja: 少なく読む

# Book
source: Book Appointment
ar: احجز موعدًا
es: Reservar cita
ja: 予約する

source: AskDoctorAI
ar: سؤال للذكاء الاصطناعي للطبيب
es: Pregunta al Doctor AI

# ErrorINAI
source: Oops! It seems like we hit a snag. Don't worry, our team is on it! Please try again soon. Thanks for your patience!
ar: آسف! يبدو أننا واجهنا مشكلة. لا داعي للقلق، فريقنا يعمل على حلها! يرجى المحاولة مرة أخرى قريبًا. شكرًا لصبرك!
es: ¡Ups! Parece que hemos tenido un problema. No te preocupes, ¡nuestro equipo ya está trabajando en ello! Por favor, intenta de nuevo pronto. ¡Gracias por tu paciencia!
ja: おっと！問題が発生しました。ご安心ください、チームが対応中です！すぐにもう一度お試しください。ご理解ありがとうございます。

# ErrorProfile
source: Oops! We couldn't fetch your date. Sorry about that! We're fixing it now.
ar: آسف! لم نتمكن من جلب بياناتك. عذرًا على ذلك! نحن نعمل على إصلاحها الآن.
es: ¡Ups! No pudimos recuperar tus datos. ¡Lo sentimos! Lo estamos solucionando ahora.
ja: おっと！データを取得できませんでした。申し訳ありません！現在修正中です。

# EmptyMessage
source: Your message didn't come through. Type something and let's chat!
ar: لم تصل رسالتك. اكتب شيئًا ولنتحدث!
es: Tu mensaje no se envió. ¡Escribe algo y charlemos!
ja: メッセージが届きませんでした。何か入力してチャットしましょう！

# FavoriteList
source: My Favorite Doctors
ar: أطبائي المفضلين
es: Mis doctores favoritos
ja: お気に入りの医師

# EmptyFavoriteList
source: Your favorite doctors list is waiting for your personal touch. Add your favorites to keep them close!
ar: قائمة الأطباء المفضلين الخاصة بك تنتظر لمستك الشخصية. أضف أطباءك المفضلين لتبقيهم قريبين!
es: Tu lista de doctores favoritos está esperando tu toque personal. ¡Añade tus favoritos para tenerlos cerca!
ja: お気に入りの医師リストがあなたの個人的なタッチを待っています。お気に入りを追加して近くに保ちましょう！

# ErrorGetDays
source: Oops! Can't fetch the days right now. Please check back soon. Thanks for your patience!
ar: آسف! لا يمكننا جلب الأيام الآن. يرجى التحقق مرة أخرى قريبًا. شكرًا لصبرك!
es: ¡Ups! No se pueden recuperar los días en este momento. Por favor, vuelve a intentarlo pronto. ¡Gracias por tu paciencia!
ja: おっと！現在日付を取得できません。すぐにもう一度確認してください。ご理解ありがとうございます。

# create
source: Create Your Profile
ar: إنشاء ملفك الشخصي
es: Crea tu perfil
ja: プロフィールを作成する

# messagecreate
source: Please create your profile to book an appointment. This helps us serve you better. Thank you!
ar: يرجى إنشاء ملفك الشخصي لحجز موعد. هذا يساعدنا في خدمتك بشكل أفضل. شكرًا لك!
es: Por favor, crea tu perfil para reservar una cita. Esto nos ayuda a servirte mejor. ¡Gracias!
ja: 予約をするにはプロフィールを作成してください。これにより、私たちはあなたをより良くサポートできます。ありがとうございます！

source: Specialty
ar: التخصص
es: Especialidad
ja: 専門

# Note
source: Notes
ar: ملاحظات
es: Notas
ja: ノート

# EXP
source: Years of Experience
ar: سنوات الخبرة
es: Años de experiencia
ja: 経験年数

# expHome
source: EXP
ar: الخبرة
ja: 経験

# price
source: Consultation Fee
ar: رسوم الاستشارة
es: Honorarios de consulta
ja: 相談料

# ChooseDate
source: Please choose both a date and time for your appointment before proceeding.
ar: يرجى اختيار كل من التاريخ والوقت لموعدك قبل المتابعة.
es: Por favor, elige tanto una fecha como una hora para tu cita antes de proceder.
ja: 続行する前に日付と時間を選択してください。

# SuccessBook
source: Your appointment has been successfully booked! We look forward to seeing you.
ar: تم حجز موعدك بنجاح! نتطلع لرؤيتك.
es: ¡Tu cita se ha reservado con éxito! Esperamos verte pronto.
ja: 予約が成功しました！お会いできるのを楽しみにしています。

# ErrorBookl
source: Something went wrong while trying to book your appointment. Please try again later. If the problem persists, contact support for assistance.
ar: حدث خطأ أثناء محاولة حجز موعدك. يرجى المحاولة مرة أخرى لاحقًا. إذا استمرت المشكلة، اتصل بالدعم للحصول على المساعدة.
es: Algo salió mal al intentar reservar tu cita. Por favor, inténtalo de nuevo más tarde. Si el problema persiste, contacta con soporte para obtener ayuda.
ja: 予約中に問題が発生しました。後でもう一度お試しください。問題が解決しない場合は、サポートに連絡して支援を受けてください。

# ErrorBookHeadline
source: Booking Unsuccessful
ar: فشل الحجز
es: Reserva no exitosa
ja: 予約失敗

# ErrorSchedule
source: We apologize for the inconvenience. We are actively working to resolve the issue
ar: نعتذر عن الإزعاج. نحن نعمل بنشاط على حل المشكلة
es: Pedimos disculpas por los inconvenientes. Estamos trabajando activamente para resolver el problema.
ja: ご不便をおかけして申し訳ありません。問題の解決に努めています。

# ErrorDeleteSchedule
source: Oops! Something went wrong while trying to delete the item from your schedule. Please try again later.
ar: آسف! حدث خطأ أثناء محاولة حذف العنصر من جدولك. يرجى المحاولة مرة أخرى لاحقًا.
es: ¡Ups! Algo salió mal al intentar eliminar el ítem de tu horario. Por favor, inténtalo de nuevo más tarde.
ja: おっと！スケジュールからアイテムを削除中に問題が発生しました。後でもう一度お試しください。

# ErrorBook
source: Oops! Something went wrong while trying to book your appointment. Please try again later.
ar: آسف! حدث خطأ أثناء محاولة حجز موعدك. يرجى المحاولة مرة أخرى لاحقًا.
es: ¡Ups! Algo salió mal al intentar reservar tu cita. Por favor, inténtalo de nuevo más tarde.
ja: おっと！予約中に問題が発生しました。後でもう一度お試しください。

source: Cancel
ar: إلغاء
es: Cancelar
ja: キャンセル

# FindDoctor
source: Search for Your Doctor
ar: ابحث عن طبيبك
es: Buscar a tu doctor
ja: 医師を検索

source: All
ar: الجميع
es: Todos
ja: すべて

source: Psychologist
ar: الأخصائي النفسي
es: Psicólogo
ja: 心理学者

source: Orthopedist
ar: أخصائي العظام
es: Ortopedista
ja: 整形外科医

source: Physical therapy
ar: العلاج الطبيعي
es: Fisioterapia
ja: 理学療法

source: Dermatologist
ar: أخصائي الجلدية
es: Dermatólogo
ja: 皮膚科医

source: Pediatrician
ar: طبيب الأطفال
es: Pediatra
ja: 小児科医

source: Neurologist
ar: أخصائي الأعصاب
es: Neurólogo
ja: 神経科医

source: Cardiologist
ar: أخصائي القلب
es: Cardiólogo
ja: 心臓病専門医

source: Upcoming
ar: القادمة
es: Próximos
ja: 今後の予定

source: Complete
ar: مكتمل
es: Completados
ja: 完了

# WelcomeAdmin
source: Admin Dashboard
ar: لوحة تحكم المسؤول
es: Panel de administración
ja: 管理者ダッシュボード

# addNewDoctor
source: Create Doctor Profile
ar: إنشاء ملف الطبيب
es: Crear perfil de doctor
ja: 医師のプロフィールを作成

# Books
source: Total appointments
ar: إجمالي المواعيد
es: Citas totales
ja: 合計予約

source: Users
ar: المستخدمون
es: Usuarios
ja: ユーザー

source: Doctors
ar: الأطباء
es: Doctores
ja: 医師

# MangeBooks
source: Manage Appointment Books
ar: إدارة كتب المواعيد
es: Gestionar libros de citas
ja: 予約管理

source: Books In Progress
ar: المواعيد قيد التنفيذ
es: Citas en progreso
ja: 進行中の予約

source: Successfully Booked
ar: تم الحجز بنجاح
es: Reservado con éxito
ja: 予約成功

source: Not available
ar: غير متاح
es: No disponible
ja: 利用不可

source: Specialization
ar: التخصص
es: Especialización
ja: 専門分野

source: Bio
ar: السيرة الذاتية
es: Biografía
ja: バイオ

source: You haven't choose yet.
ar: لم تقم بالاختيار بعد.
es: No has elegido aún.
ja: まだ選択していません。

# selectDate
source: Click the button to choose a date
ar: انقر على الزر لاختيار تاريخ
es: Haz clic en el botón para elegir una fecha
ja: 日付を選択するにはボタンをクリック

# rRating
source: Rating
ar: التقييم
es: Calificación
ja: 評価

# shortName
source: Please write at least 5 letters before saving.
ar: يرجى كتابة 5 أحرف على الأقل قبل الحفظ.
es: Por favor, escribe al menos 5 letras antes de guardar.
ja: 保存する前に少なくとも5文字を入力してください。

# shortBio
source: Please write at least 170 letters before saving.
ar: يرجى كتابة 170 حرفًا على الأقل قبل الحفظ.
es: Por favor, escribe al menos 170 letras antes de guardar.
ja: 保存する前に少なくとも170文字を入力してください。

# ChooseYear
source: Please select the number of years of experience before saving.
ar: يرجى تحديد عدد سنوات الخبرة قبل الحفظ.
es: Por favor, selecciona el número de años de experiencia antes de guardar.
ja: 保存する前に経験年数を選択してください。

# ChooseRating
source: Please choose a rating before saving.
ar: يرجى اختيار تقييم قبل الحفظ.
es: Por favor, elige una calificación antes de guardar.
ja: 保存する前に評価を選択してください。

# ChooseCategory
source: Please select a specialization before saving.
ar: يرجى اختيار التخصص قبل الحفظ.
es: Por favor, selecciona una especialización antes de guardar.
ja: 保存する前に専門分野を選択してください。

# empty
source: Please write something.
ar: يرجى كتابة شيء.
es: Por favor, escribe algo.
ja: 何か入力してください。

# didnTCategory
source: You didn't choose Specialization
ar: لم تقم باختيار التخصص
es: No elegiste especialización
ja: 専門分野を選択していません

# didnTrrating
source: You didn't choose Rating
ar: لم تقم باختيار التقييم
es: No elegiste calificación
ja: 評価を選択していません

# didnTyears
source: You didn't choose years of experience
ar: لم تقم باختيار سنوات الخبرة
es: No elegiste años de experiencia
ja: 経験年数を選択していません

# didnTimage
source: Please upload a photo for the doctor.
ar: يرجى رفع صورة للطبيب.
es: Por favor, sube una foto del doctor.
ja: 医師の写真をアップロードしてください。

# SuccessDoctorHeadS
source: Success!
ar: نجاح!
es: ¡Éxito!
ja: 成功！

# SUccessDoctorMessage
source: The doctor has been successfully added to the system.
ar: تمت إضافة الطبيب بنجاح إلى النظام.
es: El doctor se ha añadido exitosamente al sistema.
ja: 医師がシステムに正常に追加されました。

# FailedDoctorHeadF
source: Failed
ar: فشل
es: Fallido
ja: 失敗

# FailedDoctorMessageF
source: Unable to add new doctor. Please try again, contact support for assistance.
ar: لم يتمكن من إضافة طبيب جديد. يرجى المحاولة مرة أخرى، أو الاتصال بالدعم للحصول على المساعدة.
es: No se pudo añadir al nuevo doctor. Por favor, inténtalo de nuevo o contacta con soporte para asistencia.
ja: 新しい医師を追加できませんでした。もう一度お試しください。サポートに連絡して支援を受けてください。

source: Close
ar: إغلاق
es: Cerrar
ja: 閉じる

# Addschdule
source: Add Schedule
ar: إضافة جدول
es: Añadir horario
ja: スケジュールを追加

# tryLater
source: Failed ,Please try later.
ar: فشل، يرجى المحاولة لاحقًا.
es: Fallido, por favor intenta más tarde.
ja: 失敗しました、後でもう一度お試しください。

# SuccessAddDATE
source: The schedule has been added successfully ðŸŒŸ
ar: تمت إضافة الجدول بنجاح 🌟
es: El horario se ha añadido exitosamente 🌟
ja: スケジュールが正常に追加されました🌟

# SuccessDeleteSchedule
source: The date has been successfully removed
ar: تمت إزالة التاريخ بنجاح
es: La fecha se ha eliminado exitosamente
ja: 日付が正常に削除されました

# PaymentAlways
source: Use Visa as Default
ar: استخدم فيزا كافتراضي
es: Usa Visa como predeterminado
ja: ビザをデフォルトとして使用する

# titlePayment
source: Make Visa your default payment method for faster checkouts.
ar: اجعل فيزا وسيلة الدفع الافتراضية لك لإجراءات سداد أسرع.
es: Haz de Visa tu método de pago predeterminado para un pago más rápido.
ja: ビザをデフォルトの支払い方法に設定して、チェックアウトをスムーズにしましょう。

# Empty
source: This field can't be empty. Please enter the required information
ar: لا يمكن أن يكون هذا الحقل فارغًا
es: Esto no puede estar vacío
ja: これは空にできません

# donTmatch
source: Passwords don't match.
ar: كلمات المرور غير متطابقة.
es: Las contraseñas no coinciden.
ja: パスワードが一致しません。

# weakpassword
source: Password is too weak. Please choose a stronger one.
ar: كلمة المرور ضعيفة جدًا. يرجى اختيار كلمة مرور أقوى.
es: La contraseña es demasiado débil. Por favor, elige una más segura.
ja: パスワードが弱すぎます。より強力なものを選択してください。

# emailexait
source: Email already in use. Please try another one.
ar: البريد الإلكتروني قيد الاستخدام بالفعل. يرجى تجربة بريد إلكتروني آخر.
es: El correo electrónico ya está en uso. Por favor, prueba con otro.
ja: メールアドレスはすでに使用されています。別のものを試してください。

# trylater
source: Something went wrong. Please try again later.
ar: حدث خطأ. يرجى المحاولة مرة أخرى لاحقًا.
es: Algo salió mal. Por favor, inténtalo de nuevo más tarde.
ja: 何か問題が発生しました。後でもう一度お試しください。

# wrongPassword
source: The password you entered is incorrect. Please try again
ar: كلمة المرور التي أدخلتها غير صحيحة. يرجى المحاولة مرة أخرى.
es: La contraseña que ingresaste es incorrecta. Por favor, inténtalo de nuevo.
ja: 入力したパスワードが正しくありません。もう一度お試しください。

# noemailexit
source: Email not found. Please check or sign up.
ar: البريد الإلكتروني غير موجود. يرجى التحقق أو التسجيل.
es: Correo electrónico no encontrado. Por favor, verifica o regístrate.
ja: メールが見つかりません。確認するか、サインアップしてください。

# nointernet
source: Oops! We can't connect right now. Please check your internet and try again.
ar: آسف! لا يمكننا الاتصال في الوقت الحالي. يرجى التحقق من الإنترنت والمحاولة مرة أخرى.
es: ¡Ups! No podemos conectar en este momento. Verifica tu conexión a internet y vuelve a intentarlo.
ja: おっと！今は接続できません。インターネットを確認して、もう一度お試しください。

# tryagain
source: Unable to Login with Google, Please try later.
ar: تعذر تسجيل الدخول باستخدام جوجل، يرجى المحاولة لاحقًا.
es: No se pudo iniciar sesión con Google. Por favor, inténtalo más tarde.
ja: Googleでログインできません。後でもう一度お試しください。

# checkEmail
source: Please check your email and complete the verification process. Thank you!
ar: يرجى التحقق من بريدك الإلكتروني وإكمال عملية التحقق. شكرًا لك!
es: Por favor, revisa tu correo electrónico y completa el proceso de verificación. ¡Gracias!
ja: メールを確認し、確認プロセスを完了してください。ありがとうございます！

# headlinecheck
source: Verification Email
ar: بريد التحقق
es: Correo electrónico de verificación
ja: 確認メール

# verifyAgin
source: Send Verification Link Again
ar: إرسال رابط التحقق مرة أخرى
es: Enviar enlace de verificación nuevamente
ja: 確認リンクを再送信

# NotVerify
source: Please verify your email to complete registration.
ar: يرجى التحقق من بريدك الإلكتروني لإكمال التسجيل.
es: Por favor, verifica tu correo electrónico para completar el registro.
ja: 登録を完了するには、メールを確認してください。

# waitverify
source: You have requested a verification email recently. Please give it a bit of time before trying again.
ar: لقد طلبت بريد التحقق مؤخرًا. يرجى الانتظار قليلاً قبل المحاولة مرة أخرى.
es: Has solicitado un correo electrónico de verificación recientemente. Por favor, espera un poco antes de intentar de nuevo.
ja: 最近確認メールをリクエストしました。もう一度試す前に少し時間をください。

# emailsent
source: Verification email sent. Please check your email.
ar: تم إرسال بريد التحقق. يرجى التحقق من بريدك الإلكتروني.
es: Correo electrónico de verificación enviado. Por favor, revisa tu correo.
ja: 確認メールが送信されました。メールを確認してください。

# headlineaskverify
source: Email Not Verified
ar: البريد الإلكتروني غير موثوق
es: Correo electrónico no verificado
ja: メール未確認

# messageaskverify
source: Your email isn't verified yet. Do you want to verify it now?
ar: بريدك الإلكتروني ليس موثوقًا بعد. هل تريد التحقق منه الآن؟
es: Tu correo electrónico aún no está verificado. ¿Quieres verificarlo ahora?
ja: メールがまだ確認されていません。今すぐ確認しますか？

source: Verify
ar: تحقق
es: Verificar
ja: 確認する

# timerEmailresend
source: Resend verification email in:
ar: إعادة إرسال بريد التحقق في:
es: Reenviar correo electrónico de verificación en:
ja: 確認メールを再送信までの時間:

# checkveifyButton
source: Check Verification Status
ar: تحقق من حالة البريد
es: Verificar estado
ja: 確認ステータスをチェック

# successVeirfyMessage
source: Your email has been verified. You can now log in to your account and start using the app.
ar: تم التحقق من بريدك الإلكتروني. يمكنك الآن تسجيل الدخول إلى حسابك وبدء استخدام التطبيق.
es: Tu correo electrónico ha sido verificado. Ahora puedes iniciar sesión en tu cuenta y comenzar a usar la aplicación.
ja: メールが確認されました。アカウントにログインしてアプリを使用できます。

# LoginAfterVerifyButton
source: Log In Now
ar: تسجيل الدخول الآن
es: Iniciar sesión ahora
ja: 今すぐログイン

source: Forgot Password?
ar: نسيت كلمة المرور؟
es: ¿Olvidaste tu contraseña?
ja: パスワードをお忘れですか？

# writeEmail
source: Please write your email.
ar: يرجى كتابة بريدك الإلكتروني.
es: Por favor, escribe tu correo electrónico.
ja: メールアドレスを入力してください。

# passwordrestsent
source: Rest password link sent! Check your email.
ar: تم إرسال رابط إعادة تعيين كلمة المرور! تحقق من بريدك الإلكتروني.
es: ¡Enlace para restablecer la contraseña enviado! Revisa tu correo electrónico.
ja: パスワードリセットリンクが送信されました！メールを確認してください。

# endEmailAddress
source: The email must end with '@gmail.com'
ar: يجب أن ينتهي البريد الإلكتروني بـ '@gmail.com'
es: El correo electrónico debe terminar con '@gmail.com'
ja: メールアドレスは'@gmail.com'で終わる必要があります

# morethanA8
source: Your password should be at least 8 characters long.
ar: يجب أن تكون كلمة المرور الخاصة بك على الأقل 8 أحرف.
es: Tu contraseña debe tener al menos 8 caracteres.
ja: パスワードは少なくとも8文字である必要があります。

# worngemailorpassword
source: Incorrect email or password. Please try again.
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى.
es: Correo electrónico o contraseña incorrectos. Por favor, inténtalo de nuevo.
ja: メールアドレスまたはパスワードが間違っています。もう一度お試しください。

# toomanyrequst
source: Too many login attempts. Please try again later.
ar: محاولات تسجيل دخول كثيرة جدًا. يرجى المحاولة مرة أخرى لاحقًا.
es: Demasiados intentos de inicio de sesión. Por favor, inténtalo de nuevo más tarde.
ja: ログイン試行が多すぎます。後でもう一度お試しください。

source: Dark
ar: داكن
es: Oscuro
ja: ダーク

source: Light
ar: فاتح
es: Claro
ja: ライト

# years
source: Years exp
ar: سنوات الخبرة
es: Años de experiencia
ja: 経験年数

# askDoctorAI
source: Ask Ai Doctor
ar: أسال الذكاء الاصطناعي
es: Preguntar al Doctor AI
ja: AIドクターに尋ねる

# imageCancel
source: Image selection canceled.
ar: تم إلغاء اختبار الصورة
es: Selección de imagen cancelada.
ja: 画像の選択がキャンセルされました。
